3D_riblet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    leftWall
    {
        type            patch;
        nFaces          4800;
        startFace       2722560;
    }
    rightWall
    {
        type            patch;
        nFaces          4800;
        startFace       2727360;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          36480;
        startFace       2732160;
    }
    upperWall
    {
        type            patch;
        nFaces          23040;
        startFace       2768640;
    }
    frontWall
    {
        type            patch;
        nFaces          7680;
        startFace       2791680;
    }
    backWall
    {
        type            patch;
        nFaces          7680;
        startFace       2799360;
    }
)

// ************************************************************************* //
